results-homelab-colocated/output_homelab_colocate_3vm_gemfire_macbook-10000_1t_run.txt
/Library/Java/JavaVirtualMachines/adoptopenjdk-8.jdk/Contents/Home/bin/java  -classpath /Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/conf:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/core/target/core-0.18.0-SNAPSHOT.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/core/target/dependency/HdrHistogram-2.1.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/core/target/dependency/jackson-core-asl-1.9.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/geode-binding-0.18.0-SNAPSHOT.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/HdrHistogram-2.1.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/LatencyUtils-2.0.3.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/antlr-2.7.7.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/bson-4.8.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/classgraph-4.8.154.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-beanutils-1.9.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-codec-1.11.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-collections-3.2.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-digester-2.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-io-2.11.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-lang3-3.12.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-logging-1.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-validator-1.7.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/fastutil-8.5.11.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-common-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-core-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-deployment-chained-classloader-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-logging-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-management-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-membership-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-serialization-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-tcp-messenger-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-tcp-server-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-unsafe-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-version-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/httpclient-4.5.14.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/httpcore-4.4.16.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/istack-commons-runtime-4.0.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jackson-annotations-2.16.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jackson-core-2.16.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jackson-databind-2.16.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jackson-datatype-joda-2.16.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jackson-datatype-jsr310-2.16.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/javax.activation-api-1.2.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/javax.resource-api-1.7.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/javax.transaction-api-1.3.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jaxb-api-2.3.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jaxb-impl-2.3.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jgroups-3.6.14.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jna-5.12.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jna-platform-5.12.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/joda-time-2.10.14.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jopt-simple-5.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/log4j-api-2.19.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/micrometer-commons-1.10.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/micrometer-core-1.10.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/micrometer-observation-1.10.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-buffer-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-codec-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-common-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-handler-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-resolver-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-transport-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-transport-native-unix-common-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/rmiio-2.1.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-cache-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-config-core-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-config-ogdl-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-core-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-crypto-cipher-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-crypto-core-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-crypto-hash-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-event-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-lang-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/slf4j-api-1.7.25.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/spring-beans-5.3.34.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/spring-core-5.3.34.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/spring-jcl-5.3.34.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/spring-web-5.3.34.jar site.ycsb.Client -t -db site.ycsb.db.GeodeClient -P ../YCSB-geode-custom/workloads/workloada -p geode.locator=192.168.0.78[55221] -P ./ycsb.config -P ./gemfire.config -s
Command line: -t -db site.ycsb.db.GeodeClient -P ../YCSB-geode-custom/workloads/workloada -p geode.locator=192.168.0.78[55221] -P ./ycsb.config -P ./gemfire.config -s
[INFO] recordcount:10000
[INFO] threadcount:1
[INFO] operationcount:10000
[INFO] readproportion:0.5
[INFO] updateproportion:0.5
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
2024-04-20 23:37:04:478 0 sec: 0 operations; est completion in 0 second 
ERROR StatusLogger Log4j2 could not find a logging implementation. Please add log4j-core to the classpath. Using SimpleLogger to log to the console...
[DEBUG] GeodeClient.java addPoolLocator:4c5fec0a-a29e-461a-a8a4-c9c6af900194.locator-server.network.service-instance-1d8cf652-27f5-4220-a04f-1cadb69b08fe.bosh:55221
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
## UserPasswordAuthInit security-username:cluster_operator_kSZXA6unTmdKT3slnH5EJg
## UserPasswordAuthInit security-username:cluster_operator_kSZXA6unTmdKT3slnH5EJg
## UserPasswordAuthInit security-username:cluster_operator_kSZXA6unTmdKT3slnH5EJg
2024-04-20 23:37:14:453 10 sec: 1131 operations; 113.03 current ops/sec; est completion in 1 minute [READ: Count=584, Max=29791, Min=3428, Avg=6502.83, 90=10599, 99=18047, 99.9=25231, 99.99=29791] [UPDATE: Count=552, Max=856575, Min=3172, Avg=8177.74, 90=9855, 99=24879, 99.9=123007, 99.99=856575] 
2024-04-20 23:37:24:451 20 sec: 3191 operations; 206 current ops/sec; est completion in 43 seconds [READ: Count=1018, Max=29711, Min=2820, Avg=4765.27, 90=6679, 99=12087, 99.9=23375, 99.99=29711] [UPDATE: Count=1039, Max=20367, Min=2588, Avg=4764.26, 90=6975, 99=13111, 99.9=18847, 99.99=20367] 
2024-04-20 23:37:34:454 30 sec: 5193 operations; 200.2 current ops/sec; est completion in 28 seconds [READ: Count=957, Max=112511, Min=2908, Avg=5073.52, 90=7267, 99=13615, 99.9=45663, 99.99=112511] [UPDATE: Count=1045, Max=35839, Min=2850, Avg=4747.31, 90=6675, 99=13095, 99.9=33631, 99.99=35839] 
2024-04-20 23:37:44:454 40 sec: 7170 operations; 197.7 current ops/sec; est completion in 16 seconds [READ: Count=1022, Max=36031, Min=2734, Avg=4933.49, 90=7103, 99=13839, 99.9=32959, 99.99=36031] [UPDATE: Count=953, Max=26623, Min=2498, Avg=5037.01, 90=7355, 99=14623, 99.9=23535, 99.99=26623] 
2024-04-20 23:37:54:450 50 sec: 9283 operations; 211.3 current ops/sec; est completion in 4 second [READ: Count=1055, Max=57023, Min=2508, Avg=4741.24, 90=6623, 99=12079, 99.9=28239, 99.99=57023] [UPDATE: Count=1060, Max=56095, Min=2466, Avg=4634.69, 90=6463, 99=10463, 99.9=22735, 99.99=56095] 
2024-04-20 23:37:57:769 53 sec: 10000 operations; 215.96 current ops/sec; [READ: Count=349, Max=16479, Min=2282, Avg=4567.37, 90=6307, 99=11615, 99.9=16479, 99.99=16479] [CLEANUP: Count=1, Max=10, Min=10, Avg=10, 90=10, 99=10, 99.9=10, 99.99=10] [UPDATE: Count=366, Max=38751, Min=2584, Avg=4600.17, 90=6415, 99=10055, 99.9=38751, 99.99=38751] 
[OVERALL], RunTime(ms), 53326
[OVERALL], Throughput(ops/sec), 187.52578479540938
[TOTAL_GCS_PS_Scavenge], Count, 2
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 46
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.08626186100588831
[TOTAL_GCS_PS_MarkSweep], Count, 1
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 20
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.037505156959081874
[TOTAL_GCs], Count, 3
[TOTAL_GC_TIME], Time(ms), 66
[TOTAL_GC_TIME_%], Time(%), 0.12376701796497018
[READ], Operations, 4985
[READ], AverageLatency(us), 5043.551053159478
[READ], MinLatency(us), 2282
[READ], MaxLatency(us), 112511
[READ], 95thPercentileLatency(us), 8959
[READ], 99thPercentileLatency(us), 14391
[READ], Return=OK, 4985
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 10.0
[CLEANUP], MinLatency(us), 10
[CLEANUP], MaxLatency(us), 10
[CLEANUP], 95thPercentileLatency(us), 10
[CLEANUP], 99thPercentileLatency(us), 10
[UPDATE], Operations, 5015
[UPDATE], AverageLatency(us), 5148.918444666002
[UPDATE], MinLatency(us), 2466
[UPDATE], MaxLatency(us), 856575
[UPDATE], 95thPercentileLatency(us), 8807
[UPDATE], 99thPercentileLatency(us), 14623
[UPDATE], Return=OK, 5015